run_production_average_2026-01-13-Dockerfile-aft.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: k6/functionary/tests/front-functionary.js
 web dashboard: http://127.0.0.1:5665
        output: -

     scenarios: (100.00%) 1 scenario, 58 max VUs, 5m20s max duration (incl. graceful stop):
              * default: Up to 58 looping VUs for 4m50s over 7 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 01/58 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 01/58 VUs  0m01.0s/4m50.0s

running (0m02.0s), 02/58 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 02/58 VUs  0m02.0s/4m50.0s

running (0m03.0s), 03/58 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 03/58 VUs  0m03.0s/4m50.0s

running (0m04.0s), 04/58 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 04/58 VUs  0m04.0s/4m50.0s

running (0m05.0s), 05/58 VUs, 1 complete and 0 interrupted iterations
default   [   2% ] 05/58 VUs  0m05.0s/4m50.0s

running (0m06.0s), 06/58 VUs, 2 complete and 0 interrupted iterations
default   [   2% ] 06/58 VUs  0m06.0s/4m50.0s

running (0m07.0s), 07/58 VUs, 3 complete and 0 interrupted iterations
default   [   2% ] 07/58 VUs  0m07.0s/4m50.0s

running (0m08.0s), 08/58 VUs, 5 complete and 0 interrupted iterations
default   [   3% ] 08/58 VUs  0m08.0s/4m50.0s

running (0m09.0s), 09/58 VUs, 7 complete and 0 interrupted iterations
default   [   3% ] 09/58 VUs  0m09.0s/4m50.0s

running (0m10.0s), 10/58 VUs, 9 complete and 0 interrupted iterations
default   [   3% ] 10/58 VUs  0m10.0s/4m50.0s

running (0m11.0s), 11/58 VUs, 11 complete and 0 interrupted iterations
default   [   4% ] 11/58 VUs  0m11.0s/4m50.0s

running (0m12.0s), 12/58 VUs, 15 complete and 0 interrupted iterations
default   [   4% ] 12/58 VUs  0m12.0s/4m50.0s

running (0m13.0s), 13/58 VUs, 17 complete and 0 interrupted iterations
default   [   4% ] 13/58 VUs  0m13.0s/4m50.0s

running (0m14.0s), 14/58 VUs, 20 complete and 0 interrupted iterations
default   [   5% ] 14/58 VUs  0m14.0s/4m50.0s

running (0m15.0s), 15/58 VUs, 24 complete and 0 interrupted iterations
default   [   5% ] 15/58 VUs  0m15.0s/4m50.0s

running (0m16.0s), 16/58 VUs, 28 complete and 0 interrupted iterations
default   [   6% ] 16/58 VUs  0m16.0s/4m50.0s

running (0m17.0s), 17/58 VUs, 32 complete and 0 interrupted iterations
default   [   6% ] 17/58 VUs  0m17.0s/4m50.0s

running (0m18.0s), 18/58 VUs, 37 complete and 0 interrupted iterations
default   [   6% ] 18/58 VUs  0m18.0s/4m50.0s

running (0m19.0s), 19/58 VUs, 41 complete and 0 interrupted iterations
default   [   7% ] 19/58 VUs  0m19.0s/4m50.0s

running (0m20.0s), 19/58 VUs, 46 complete and 0 interrupted iterations
default   [   7% ] 19/58 VUs  0m20.0s/4m50.0s

running (0m21.0s), 20/58 VUs, 50 complete and 0 interrupted iterations
default   [   7% ] 20/58 VUs  0m21.0s/4m50.0s

running (0m22.0s), 21/58 VUs, 57 complete and 0 interrupted iterations
default   [   8% ] 21/58 VUs  0m22.0s/4m50.0s

running (0m23.0s), 22/58 VUs, 61 complete and 0 interrupted iterations
default   [   8% ] 22/58 VUs  0m23.0s/4m50.0s

running (0m24.0s), 23/58 VUs, 67 complete and 0 interrupted iterations
default   [   8% ] 23/58 VUs  0m24.0s/4m50.0s

running (0m25.0s), 24/58 VUs, 74 complete and 0 interrupted iterations
default   [   9% ] 24/58 VUs  0m25.0s/4m50.0s

running (0m26.0s), 25/58 VUs, 81 complete and 0 interrupted iterations
default   [   9% ] 25/58 VUs  0m26.0s/4m50.0s

running (0m27.0s), 26/58 VUs, 87 complete and 0 interrupted iterations
default   [   9% ] 26/58 VUs  0m27.0s/4m50.0s

running (0m28.0s), 27/58 VUs, 95 complete and 0 interrupted iterations
default   [  10% ] 27/58 VUs  0m28.0s/4m50.0s

running (0m29.0s), 28/58 VUs, 103 complete and 0 interrupted iterations
default   [  10% ] 28/58 VUs  0m29.0s/4m50.0s

running (0m30.0s), 29/58 VUs, 110 complete and 0 interrupted iterations
default   [  10% ] 29/58 VUs  0m30.0s/4m50.0s

running (0m31.0s), 30/58 VUs, 117 complete and 0 interrupted iterations
default   [  11% ] 30/58 VUs  0m31.0s/4m50.0s

running (0m32.0s), 31/58 VUs, 127 complete and 0 interrupted iterations
default   [  11% ] 31/58 VUs  0m32.0s/4m50.0s

running (0m33.0s), 32/58 VUs, 135 complete and 0 interrupted iterations
default   [  11% ] 32/58 VUs  0m33.0s/4m50.0s

running (0m34.0s), 33/58 VUs, 144 complete and 0 interrupted iterations
default   [  12% ] 33/58 VUs  0m34.0s/4m50.0s

running (0m35.0s), 34/58 VUs, 153 complete and 0 interrupted iterations
default   [  12% ] 34/58 VUs  0m35.0s/4m50.0s

running (0m36.0s), 35/58 VUs, 164 complete and 0 interrupted iterations
default   [  12% ] 35/58 VUs  0m36.0s/4m50.0s

running (0m37.0s), 36/58 VUs, 172 complete and 0 interrupted iterations
default   [  13% ] 36/58 VUs  0m37.0s/4m50.0s

running (0m38.0s), 37/58 VUs, 181 complete and 0 interrupted iterations
default   [  13% ] 37/58 VUs  0m38.0s/4m50.0s

running (0m39.0s), 38/58 VUs, 192 complete and 0 interrupted iterations
default   [  13% ] 38/58 VUs  0m39.0s/4m50.0s

running (0m40.0s), 38/58 VUs, 202 complete and 0 interrupted iterations
default   [  14% ] 38/58 VUs  0m40.0s/4m50.0s

running (0m41.0s), 39/58 VUs, 213 complete and 0 interrupted iterations
default   [  14% ] 39/58 VUs  0m41.0s/4m50.0s

running (0m42.0s), 40/58 VUs, 224 complete and 0 interrupted iterations
default   [  14% ] 40/58 VUs  0m42.0s/4m50.0s

running (0m43.0s), 41/58 VUs, 236 complete and 0 interrupted iterations
default   [  15% ] 41/58 VUs  0m43.0s/4m50.0s

running (0m44.0s), 42/58 VUs, 246 complete and 0 interrupted iterations
default   [  15% ] 42/58 VUs  0m44.0s/4m50.0s

running (0m45.0s), 43/58 VUs, 259 complete and 0 interrupted iterations
default   [  16% ] 43/58 VUs  0m45.0s/4m50.0s

running (0m46.0s), 44/58 VUs, 274 complete and 0 interrupted iterations
default   [  16% ] 44/58 VUs  0m46.0s/4m50.0s

running (0m47.0s), 45/58 VUs, 284 complete and 0 interrupted iterations
default   [  16% ] 45/58 VUs  0m47.0s/4m50.0s

running (0m48.0s), 46/58 VUs, 295 complete and 0 interrupted iterations
default   [  17% ] 46/58 VUs  0m48.0s/4m50.0s

running (0m49.0s), 47/58 VUs, 309 complete and 0 interrupted iterations
default   [  17% ] 47/58 VUs  0m49.0s/4m50.0s

running (0m50.0s), 48/58 VUs, 325 complete and 0 interrupted iterations
default   [  17% ] 48/58 VUs  0m50.0s/4m50.0s

running (0m51.0s), 49/58 VUs, 337 complete and 0 interrupted iterations
default   [  18% ] 49/58 VUs  0m51.0s/4m50.0s

running (0m52.0s), 50/58 VUs, 350 complete and 0 interrupted iterations
default   [  18% ] 50/58 VUs  0m52.0s/4m50.0s

running (0m53.0s), 51/58 VUs, 367 complete and 0 interrupted iterations
default   [  18% ] 51/58 VUs  0m53.0s/4m50.0s

running (0m54.0s), 52/58 VUs, 379 complete and 0 interrupted iterations
default   [  19% ] 52/58 VUs  0m54.0s/4m50.0s

running (0m55.0s), 53/58 VUs, 392 complete and 0 interrupted iterations
default   [  19% ] 53/58 VUs  0m55.0s/4m50.0s

running (0m56.0s), 54/58 VUs, 408 complete and 0 interrupted iterations
default   [  19% ] 54/58 VUs  0m56.0s/4m50.0s

running (0m57.0s), 55/58 VUs, 425 complete and 0 interrupted iterations
default   [  20% ] 55/58 VUs  0m57.0s/4m50.0s

running (0m58.0s), 56/58 VUs, 440 complete and 0 interrupted iterations
default   [  20% ] 56/58 VUs  0m58.0s/4m50.0s

running (0m59.0s), 57/58 VUs, 454 complete and 0 interrupted iterations
default   [  20% ] 57/58 VUs  0m59.0s/4m50.0s

running (1m00.0s), 57/58 VUs, 473 complete and 0 interrupted iterations
default   [  21% ] 57/58 VUs  1m00.0s/4m50.0s

running (1m01.0s), 57/58 VUs, 488 complete and 0 interrupted iterations
default   [  21% ] 57/58 VUs  1m01.0s/4m50.0s

running (1m02.0s), 56/58 VUs, 505 complete and 0 interrupted iterations
default   [  21% ] 56/58 VUs  1m02.0s/4m50.0s

running (1m03.0s), 52/58 VUs, 523 complete and 0 interrupted iterations
default   [  22% ] 52/58 VUs  1m03.0s/4m50.0s

running (1m04.0s), 47/58 VUs, 538 complete and 0 interrupted iterations
default   [  22% ] 47/58 VUs  1m04.0s/4m50.0s

running (1m05.0s), 39/58 VUs, 554 complete and 0 interrupted iterations
default   [  22% ] 39/58 VUs  1m05.0s/4m50.0s

running (1m06.0s), 35/58 VUs, 567 complete and 0 interrupted iterations
default   [  23% ] 35/58 VUs  1m06.0s/4m50.0s

running (1m07.0s), 27/58 VUs, 582 complete and 0 interrupted iterations
default   [  23% ] 27/58 VUs  1m07.0s/4m50.0s

running (1m08.0s), 22/58 VUs, 592 complete and 0 interrupted iterations
default   [  23% ] 22/58 VUs  1m08.0s/4m50.0s

running (1m09.0s), 16/58 VUs, 599 complete and 0 interrupted iterations
default   [  24% ] 16/58 VUs  1m09.0s/4m50.0s

running (1m10.0s), 10/58 VUs, 607 complete and 0 interrupted iterations
default   [  24% ] 10/58 VUs  1m10.0s/4m50.0s

running (1m11.0s), 07/58 VUs, 612 complete and 0 interrupted iterations
default   [  24% ] 07/58 VUs  1m11.0s/4m50.0s

running (1m12.0s), 11/58 VUs, 614 complete and 0 interrupted iterations
default   [  25% ] 11/58 VUs  1m12.0s/4m50.0s

running (1m13.0s), 17/58 VUs, 616 complete and 0 interrupted iterations
default   [  25% ] 17/58 VUs  1m13.0s/4m50.0s

running (1m14.0s), 23/58 VUs, 617 complete and 0 interrupted iterations
default   [  26% ] 23/58 VUs  1m14.0s/4m50.0s

running (1m15.0s), 28/58 VUs, 623 complete and 0 interrupted iterations
default   [  26% ] 28/58 VUs  1m15.0s/4m50.0s

running (1m16.0s), 34/58 VUs, 630 complete and 0 interrupted iterations
default   [  26% ] 34/58 VUs  1m16.0s/4m50.0s

running (1m17.0s), 40/58 VUs, 637 complete and 0 interrupted iterations
default   [  27% ] 40/58 VUs  1m17.0s/4m50.0s

running (1m18.0s), 46/58 VUs, 646 complete and 0 interrupted iterations
default   [  27% ] 46/58 VUs  1m18.0s/4m50.0s

running (1m19.0s), 52/58 VUs, 659 complete and 0 interrupted iterations
default   [  27% ] 52/58 VUs  1m19.0s/4m50.0s

running (1m20.0s), 57/58 VUs, 672 complete and 0 interrupted iterations
default   [  28% ] 57/58 VUs  1m20.0s/4m50.0s

running (1m21.0s), 58/58 VUs, 685 complete and 0 interrupted iterations
default   [  28% ] 58/58 VUs  1m21.0s/4m50.0s

running (1m22.0s), 57/58 VUs, 703 complete and 0 interrupted iterations
default   [  28% ] 57/58 VUs  1m22.0s/4m50.0s

running (1m23.0s), 51/58 VUs, 723 complete and 0 interrupted iterations
default   [  29% ] 51/58 VUs  1m23.0s/4m50.0s

running (1m24.0s), 46/58 VUs, 737 complete and 0 interrupted iterations
default   [  29% ] 46/58 VUs  1m24.0s/4m50.0s

running (1m25.0s), 39/58 VUs, 756 complete and 0 interrupted iterations
default   [  29% ] 39/58 VUs  1m25.0s/4m50.0s

running (1m26.0s), 34/58 VUs, 768 complete and 0 interrupted iterations
default   [  30% ] 34/58 VUs  1m26.0s/4m50.0s

running (1m27.0s), 27/58 VUs, 782 complete and 0 interrupted iterations
default   [  30% ] 27/58 VUs  1m27.0s/4m50.0s

running (1m28.0s), 22/58 VUs, 790 complete and 0 interrupted iterations
default   [  30% ] 22/58 VUs  1m28.0s/4m50.0s

running (1m29.0s), 15/58 VUs, 800 complete and 0 interrupted iterations
default   [  31% ] 15/58 VUs  1m29.0s/4m50.0s

running (1m30.0s), 08/58 VUs, 808 complete and 0 interrupted iterations
default   [  31% ] 08/58 VUs  1m30.0s/4m50.0s

running (1m31.0s), 07/58 VUs, 810 complete and 0 interrupted iterations
default   [  31% ] 07/58 VUs  1m31.0s/4m50.0s

running (1m32.0s), 05/58 VUs, 815 complete and 0 interrupted iterations
default   [  32% ] 05/58 VUs  1m32.0s/4m50.0s

running (1m33.0s), 08/58 VUs, 816 complete and 0 interrupted iterations
default   [  32% ] 08/58 VUs  1m33.0s/4m50.0s

running (1m34.0s), 11/58 VUs, 817 complete and 0 interrupted iterations
default   [  32% ] 11/58 VUs  1m34.0s/4m50.0s

running (1m35.0s), 14/58 VUs, 819 complete and 0 interrupted iterations
default   [  33% ] 14/58 VUs  1m35.0s/4m50.0s

running (1m36.0s), 17/58 VUs, 823 complete and 0 interrupted iterations
default   [  33% ] 17/58 VUs  1m36.0s/4m50.0s

running (1m37.0s), 20/58 VUs, 826 complete and 0 interrupted iterations
default   [  33% ] 20/58 VUs  1m37.0s/4m50.0s

running (1m38.0s), 23/58 VUs, 831 complete and 0 interrupted iterations
default   [  34% ] 23/58 VUs  1m38.0s/4m50.0s

running (1m39.0s), 26/58 VUs, 837 complete and 0 interrupted iterations
default   [  34% ] 26/58 VUs  1m39.0s/4m50.0s

running (1m40.0s), 28/58 VUs, 843 complete and 0 interrupted iterations
default   [  34% ] 28/58 VUs  1m40.0s/4m50.0s

running (1m41.0s), 31/58 VUs, 851 complete and 0 interrupted iterations
default   [  35% ] 31/58 VUs  1m41.0s/4m50.0s

running (1m42.0s), 34/58 VUs, 859 complete and 0 interrupted iterations
default   [  35% ] 34/58 VUs  1m42.0s/4m50.0s

running (1m43.0s), 37/58 VUs, 868 complete and 0 interrupted iterations
default   [  36% ] 37/58 VUs  1m43.0s/4m50.0s

running (1m44.0s), 40/58 VUs, 877 complete and 0 interrupted iterations
default   [  36% ] 40/58 VUs  1m44.0s/4m50.0s

running (1m45.0s), 43/58 VUs, 888 complete and 0 interrupted iterations
default   [  36% ] 43/58 VUs  1m45.0s/4m50.0s

running (1m46.0s), 46/58 VUs, 899 complete and 0 interrupted iterations
default   [  37% ] 46/58 VUs  1m46.0s/4m50.0s

running (1m47.0s), 49/58 VUs, 912 complete and 0 interrupted iterations
default   [  37% ] 49/58 VUs  1m47.0s/4m50.0s

running (1m48.0s), 52/58 VUs, 925 complete and 0 interrupted iterations
default   [  37% ] 52/58 VUs  1m48.0s/4m50.0s

running (1m49.0s), 55/58 VUs, 941 complete and 0 interrupted iterations
default   [  38% ] 55/58 VUs  1m49.0s/4m50.0s

running (1m50.0s), 57/58 VUs, 956 complete and 0 interrupted iterations
default   [  38% ] 57/58 VUs  1m50.0s/4m50.0s

running (1m51.0s), 58/58 VUs, 971 complete and 0 interrupted iterations
default   [  38% ] 58/58 VUs  1m51.0s/4m50.0s

running (1m52.0s), 58/58 VUs, 989 complete and 0 interrupted iterations
default   [  39% ] 58/58 VUs  1m52.0s/4m50.0s

running (1m53.0s), 58/58 VUs, 1005 complete and 0 interrupted iterations
default   [  39% ] 58/58 VUs  1m53.0s/4m50.0s

running (1m54.0s), 58/58 VUs, 1022 complete and 0 interrupted iterations
default   [  39% ] 58/58 VUs  1m54.0s/4m50.0s

running (1m55.0s), 58/58 VUs, 1038 complete and 0 interrupted iterations
default   [  40% ] 58/58 VUs  1m55.0s/4m50.0s

running (1m56.0s), 58/58 VUs, 1056 complete and 0 interrupted iterations
default   [  40% ] 58/58 VUs  1m56.0s/4m50.0s

running (1m57.0s), 58/58 VUs, 1072 complete and 0 interrupted iterations
default   [  40% ] 58/58 VUs  1m57.0s/4m50.0s

running (1m58.0s), 58/58 VUs, 1090 complete and 0 interrupted iterations
default   [  41% ] 58/58 VUs  1m58.0s/4m50.0s

running (1m59.0s), 58/58 VUs, 1107 complete and 0 interrupted iterations
default   [  41% ] 58/58 VUs  1m59.0s/4m50.0s

running (2m00.0s), 58/58 VUs, 1124 complete and 0 interrupted iterations
default   [  41% ] 58/58 VUs  2m00.0s/4m50.0s

running (2m01.0s), 58/58 VUs, 1140 complete and 0 interrupted iterations
default   [  42% ] 58/58 VUs  2m01.0s/4m50.0s

running (2m02.0s), 58/58 VUs, 1158 complete and 0 interrupted iterations
default   [  42% ] 58/58 VUs  2m02.0s/4m50.0s

running (2m03.0s), 58/58 VUs, 1175 complete and 0 interrupted iterations
default   [  42% ] 58/58 VUs  2m03.0s/4m50.0s

running (2m04.0s), 58/58 VUs, 1192 complete and 0 interrupted iterations
default   [  43% ] 58/58 VUs  2m04.0s/4m50.0s

running (2m05.0s), 58/58 VUs, 1211 complete and 0 interrupted iterations
default   [  43% ] 58/58 VUs  2m05.0s/4m50.0s

running (2m06.0s), 58/58 VUs, 1228 complete and 0 interrupted iterations
default   [  43% ] 58/58 VUs  2m06.0s/4m50.0s

running (2m07.0s), 58/58 VUs, 1245 complete and 0 interrupted iterations
default   [  44% ] 58/58 VUs  2m07.0s/4m50.0s

running (2m08.0s), 58/58 VUs, 1261 complete and 0 interrupted iterations
default   [  44% ] 58/58 VUs  2m08.0s/4m50.0s

running (2m09.0s), 58/58 VUs, 1277 complete and 0 interrupted iterations
default   [  44% ] 58/58 VUs  2m09.0s/4m50.0s

running (2m10.0s), 58/58 VUs, 1297 complete and 0 interrupted iterations
default   [  45% ] 58/58 VUs  2m10.0s/4m50.0s

running (2m11.0s), 58/58 VUs, 1312 complete and 0 interrupted iterations
default   [  45% ] 58/58 VUs  2m11.0s/4m50.0s

running (2m12.0s), 58/58 VUs, 1328 complete and 0 interrupted iterations
default   [  46% ] 58/58 VUs  2m12.0s/4m50.0s

running (2m13.0s), 58/58 VUs, 1345 complete and 0 interrupted iterations
default   [  46% ] 58/58 VUs  2m13.0s/4m50.0s

running (2m14.0s), 58/58 VUs, 1363 complete and 0 interrupted iterations
default   [  46% ] 58/58 VUs  2m14.0s/4m50.0s

running (2m15.0s), 58/58 VUs, 1378 complete and 0 interrupted iterations
default   [  47% ] 58/58 VUs  2m15.0s/4m50.0s

running (2m16.0s), 58/58 VUs, 1395 complete and 0 interrupted iterations
default   [  47% ] 58/58 VUs  2m16.0s/4m50.0s

running (2m17.0s), 58/58 VUs, 1416 complete and 0 interrupted iterations
default   [  47% ] 58/58 VUs  2m17.0s/4m50.0s

running (2m18.0s), 58/58 VUs, 1432 complete and 0 interrupted iterations
default   [  48% ] 58/58 VUs  2m18.0s/4m50.0s

running (2m19.0s), 58/58 VUs, 1450 complete and 0 interrupted iterations
default   [  48% ] 58/58 VUs  2m19.0s/4m50.0s

running (2m20.0s), 58/58 VUs, 1466 complete and 0 interrupted iterations
default   [  48% ] 58/58 VUs  2m20.0s/4m50.0s

running (2m21.0s), 58/58 VUs, 1484 complete and 0 interrupted iterations
default   [  49% ] 58/58 VUs  2m21.0s/4m50.0s

running (2m22.0s), 58/58 VUs, 1501 complete and 0 interrupted iterations
default   [  49% ] 58/58 VUs  2m22.0s/4m50.0s

running (2m23.0s), 58/58 VUs, 1518 complete and 0 interrupted iterations
default   [  49% ] 58/58 VUs  2m23.0s/4m50.0s

running (2m24.0s), 58/58 VUs, 1538 complete and 0 interrupted iterations
default   [  50% ] 58/58 VUs  2m24.0s/4m50.0s

running (2m25.0s), 58/58 VUs, 1552 complete and 0 interrupted iterations
default   [  50% ] 58/58 VUs  2m25.0s/4m50.0s

running (2m26.0s), 58/58 VUs, 1569 complete and 0 interrupted iterations
default   [  50% ] 58/58 VUs  2m26.0s/4m50.0s

running (2m27.0s), 58/58 VUs, 1589 complete and 0 interrupted iterations
default   [  51% ] 58/58 VUs  2m27.0s/4m50.0s

running (2m28.0s), 58/58 VUs, 1605 complete and 0 interrupted iterations
default   [  51% ] 58/58 VUs  2m28.0s/4m50.0s

running (2m29.0s), 58/58 VUs, 1622 complete and 0 interrupted iterations
default   [  51% ] 58/58 VUs  2m29.0s/4m50.0s

running (2m30.0s), 58/58 VUs, 1641 complete and 0 interrupted iterations
default   [  52% ] 58/58 VUs  2m30.0s/4m50.0s

running (2m31.0s), 58/58 VUs, 1658 complete and 0 interrupted iterations
default   [  52% ] 58/58 VUs  2m31.0s/4m50.0s

running (2m32.0s), 58/58 VUs, 1673 complete and 0 interrupted iterations
default   [  52% ] 58/58 VUs  2m32.0s/4m50.0s

running (2m33.0s), 58/58 VUs, 1691 complete and 0 interrupted iterations
default   [  53% ] 58/58 VUs  2m33.0s/4m50.0s

running (2m34.0s), 58/58 VUs, 1708 complete and 0 interrupted iterations
default   [  53% ] 58/58 VUs  2m34.0s/4m50.0s

running (2m35.0s), 58/58 VUs, 1727 complete and 0 interrupted iterations
default   [  53% ] 58/58 VUs  2m35.0s/4m50.0s

running (2m36.0s), 58/58 VUs, 1741 complete and 0 interrupted iterations
default   [  54% ] 58/58 VUs  2m36.0s/4m50.0s

running (2m37.0s), 58/58 VUs, 1762 complete and 0 interrupted iterations
default   [  54% ] 58/58 VUs  2m37.0s/4m50.0s

running (2m38.0s), 58/58 VUs, 1779 complete and 0 interrupted iterations
default   [  54% ] 58/58 VUs  2m38.0s/4m50.0s

running (2m39.0s), 58/58 VUs, 1796 complete and 0 interrupted iterations
default   [  55% ] 58/58 VUs  2m39.0s/4m50.0s

running (2m40.0s), 58/58 VUs, 1812 complete and 0 interrupted iterations
default   [  55% ] 58/58 VUs  2m40.0s/4m50.0s

running (2m41.0s), 58/58 VUs, 1831 complete and 0 interrupted iterations
default   [  56% ] 58/58 VUs  2m41.0s/4m50.0s

running (2m42.0s), 58/58 VUs, 1845 complete and 0 interrupted iterations
default   [  56% ] 58/58 VUs  2m42.0s/4m50.0s

running (2m43.0s), 58/58 VUs, 1863 complete and 0 interrupted iterations
default   [  56% ] 58/58 VUs  2m43.0s/4m50.0s

running (2m44.0s), 58/58 VUs, 1880 complete and 0 interrupted iterations
default   [  57% ] 58/58 VUs  2m44.0s/4m50.0s

running (2m45.0s), 58/58 VUs, 1897 complete and 0 interrupted iterations
default   [  57% ] 58/58 VUs  2m45.0s/4m50.0s

running (2m46.0s), 58/58 VUs, 1913 complete and 0 interrupted iterations
default   [  57% ] 58/58 VUs  2m46.0s/4m50.0s

running (2m47.0s), 58/58 VUs, 1933 complete and 0 interrupted iterations
default   [  58% ] 58/58 VUs  2m47.0s/4m50.0s

running (2m48.0s), 58/58 VUs, 1948 complete and 0 interrupted iterations
default   [  58% ] 58/58 VUs  2m48.0s/4m50.0s

running (2m49.0s), 58/58 VUs, 1965 complete and 0 interrupted iterations
default   [  58% ] 58/58 VUs  2m49.0s/4m50.0s

running (2m50.0s), 58/58 VUs, 1979 complete and 0 interrupted iterations
default   [  59% ] 58/58 VUs  2m50.0s/4m50.0s

running (2m51.0s), 58/58 VUs, 2000 complete and 0 interrupted iterations
default   [  59% ] 58/58 VUs  2m51.0s/4m50.0s

running (2m52.0s), 58/58 VUs, 2015 complete and 0 interrupted iterations
default   [  59% ] 58/58 VUs  2m52.0s/4m50.0s

running (2m53.0s), 58/58 VUs, 2031 complete and 0 interrupted iterations
default   [  60% ] 58/58 VUs  2m53.0s/4m50.0s

running (2m54.0s), 58/58 VUs, 2051 complete and 0 interrupted iterations
default   [  60% ] 58/58 VUs  2m54.0s/4m50.0s

running (2m55.0s), 58/58 VUs, 2066 complete and 0 interrupted iterations
default   [  60% ] 58/58 VUs  2m55.0s/4m50.0s

running (2m56.0s), 58/58 VUs, 2083 complete and 0 interrupted iterations
default   [  61% ] 58/58 VUs  2m56.0s/4m50.0s

running (2m57.0s), 58/58 VUs, 2098 complete and 0 interrupted iterations
default   [  61% ] 58/58 VUs  2m57.0s/4m50.0s

running (2m58.0s), 58/58 VUs, 2119 complete and 0 interrupted iterations
default   [  61% ] 58/58 VUs  2m58.0s/4m50.0s

running (2m59.0s), 58/58 VUs, 2132 complete and 0 interrupted iterations
default   [  62% ] 58/58 VUs  2m59.0s/4m50.0s

running (3m00.0s), 58/58 VUs, 2152 complete and 0 interrupted iterations
default   [  62% ] 58/58 VUs  3m00.0s/4m50.0s

running (3m01.0s), 58/58 VUs, 2170 complete and 0 interrupted iterations
default   [  62% ] 58/58 VUs  3m01.0s/4m50.0s

running (3m02.0s), 58/58 VUs, 2186 complete and 0 interrupted iterations
default   [  63% ] 58/58 VUs  3m02.0s/4m50.0s

running (3m03.0s), 58/58 VUs, 2203 complete and 0 interrupted iterations
default   [  63% ] 58/58 VUs  3m03.0s/4m50.0s

running (3m04.0s), 58/58 VUs, 2219 complete and 0 interrupted iterations
default   [  63% ] 58/58 VUs  3m04.0s/4m50.0s

running (3m05.0s), 58/58 VUs, 2237 complete and 0 interrupted iterations
default   [  64% ] 58/58 VUs  3m05.0s/4m50.0s

running (3m06.0s), 58/58 VUs, 2253 complete and 0 interrupted iterations
default   [  64% ] 58/58 VUs  3m06.0s/4m50.0s

running (3m07.0s), 58/58 VUs, 2269 complete and 0 interrupted iterations
default   [  64% ] 58/58 VUs  3m07.0s/4m50.0s

running (3m08.0s), 58/58 VUs, 2291 complete and 0 interrupted iterations
default   [  65% ] 58/58 VUs  3m08.0s/4m50.0s

running (3m09.0s), 58/58 VUs, 2303 complete and 0 interrupted iterations
default   [  65% ] 58/58 VUs  3m09.0s/4m50.0s

running (3m10.0s), 58/58 VUs, 2322 complete and 0 interrupted iterations
default   [  66% ] 58/58 VUs  3m10.0s/4m50.0s

running (3m11.0s), 58/58 VUs, 2342 complete and 0 interrupted iterations
default   [  66% ] 58/58 VUs  3m11.0s/4m50.0s

running (3m12.0s), 58/58 VUs, 2356 complete and 0 interrupted iterations
default   [  66% ] 58/58 VUs  3m12.0s/4m50.0s

running (3m13.0s), 58/58 VUs, 2375 complete and 0 interrupted iterations
default   [  67% ] 58/58 VUs  3m13.0s/4m50.0s

running (3m14.0s), 58/58 VUs, 2388 complete and 0 interrupted iterations
default   [  67% ] 58/58 VUs  3m14.0s/4m50.0s

running (3m15.0s), 58/58 VUs, 2410 complete and 0 interrupted iterations
default   [  67% ] 58/58 VUs  3m15.0s/4m50.0s

running (3m16.0s), 58/58 VUs, 2422 complete and 0 interrupted iterations
default   [  68% ] 58/58 VUs  3m16.0s/4m50.0s

running (3m17.0s), 58/58 VUs, 2442 complete and 0 interrupted iterations
default   [  68% ] 58/58 VUs  3m17.0s/4m50.0s

running (3m18.0s), 58/58 VUs, 2462 complete and 0 interrupted iterations
default   [  68% ] 58/58 VUs  3m18.0s/4m50.0s

running (3m19.0s), 58/58 VUs, 2475 complete and 0 interrupted iterations
default   [  69% ] 58/58 VUs  3m19.0s/4m50.0s

running (3m20.0s), 58/58 VUs, 2496 complete and 0 interrupted iterations
default   [  69% ] 58/58 VUs  3m20.0s/4m50.0s

running (3m21.0s), 58/58 VUs, 2512 complete and 0 interrupted iterations
default   [  69% ] 58/58 VUs  3m21.0s/4m50.0s

running (3m22.0s), 58/58 VUs, 2530 complete and 0 interrupted iterations
default   [  70% ] 58/58 VUs  3m22.0s/4m50.0s

running (3m23.0s), 58/58 VUs, 2547 complete and 0 interrupted iterations
default   [  70% ] 58/58 VUs  3m23.0s/4m50.0s

running (3m24.0s), 58/58 VUs, 2562 complete and 0 interrupted iterations
default   [  70% ] 58/58 VUs  3m24.0s/4m50.0s

running (3m25.0s), 58/58 VUs, 2583 complete and 0 interrupted iterations
default   [  71% ] 58/58 VUs  3m25.0s/4m50.0s

running (3m26.0s), 58/58 VUs, 2599 complete and 0 interrupted iterations
default   [  71% ] 58/58 VUs  3m26.0s/4m50.0s

running (3m27.0s), 58/58 VUs, 2615 complete and 0 interrupted iterations
default   [  71% ] 58/58 VUs  3m27.0s/4m50.0s

running (3m28.0s), 58/58 VUs, 2633 complete and 0 interrupted iterations
default   [  72% ] 58/58 VUs  3m28.0s/4m50.0s

running (3m29.0s), 58/58 VUs, 2649 complete and 0 interrupted iterations
default   [  72% ] 58/58 VUs  3m29.0s/4m50.0s

running (3m30.0s), 58/58 VUs, 2669 complete and 0 interrupted iterations
default   [  72% ] 58/58 VUs  3m30.0s/4m50.0s

running (3m31.0s), 58/58 VUs, 2687 complete and 0 interrupted iterations
default   [  73% ] 58/58 VUs  3m31.0s/4m50.0s

running (3m32.0s), 58/58 VUs, 2704 complete and 0 interrupted iterations
default   [  73% ] 58/58 VUs  3m32.0s/4m50.0s

running (3m33.0s), 58/58 VUs, 2720 complete and 0 interrupted iterations
default   [  73% ] 58/58 VUs  3m33.0s/4m50.0s

running (3m34.0s), 58/58 VUs, 2739 complete and 0 interrupted iterations
default   [  74% ] 58/58 VUs  3m34.0s/4m50.0s

running (3m35.0s), 58/58 VUs, 2755 complete and 0 interrupted iterations
default   [  74% ] 58/58 VUs  3m35.0s/4m50.0s

running (3m36.0s), 58/58 VUs, 2773 complete and 0 interrupted iterations
default   [  74% ] 58/58 VUs  3m36.0s/4m50.0s

running (3m37.0s), 58/58 VUs, 2789 complete and 0 interrupted iterations
default   [  75% ] 58/58 VUs  3m37.0s/4m50.0s

running (3m38.0s), 58/58 VUs, 2807 complete and 0 interrupted iterations
default   [  75% ] 58/58 VUs  3m38.0s/4m50.0s

running (3m39.0s), 58/58 VUs, 2823 complete and 0 interrupted iterations
default   [  76% ] 58/58 VUs  3m39.0s/4m50.0s

running (3m40.0s), 58/58 VUs, 2842 complete and 0 interrupted iterations
default   [  76% ] 58/58 VUs  3m40.0s/4m50.0s

running (3m41.0s), 58/58 VUs, 2859 complete and 0 interrupted iterations
default   [  76% ] 58/58 VUs  3m41.0s/4m50.0s

running (3m42.0s), 58/58 VUs, 2877 complete and 0 interrupted iterations
default   [  77% ] 58/58 VUs  3m42.0s/4m50.0s

running (3m43.0s), 58/58 VUs, 2892 complete and 0 interrupted iterations
default   [  77% ] 58/58 VUs  3m43.0s/4m50.0s

running (3m44.0s), 58/58 VUs, 2909 complete and 0 interrupted iterations
default   [  77% ] 58/58 VUs  3m44.0s/4m50.0s

running (3m45.0s), 58/58 VUs, 2930 complete and 0 interrupted iterations
default   [  78% ] 58/58 VUs  3m45.0s/4m50.0s

running (3m46.0s), 58/58 VUs, 2942 complete and 0 interrupted iterations
default   [  78% ] 58/58 VUs  3m46.0s/4m50.0s

running (3m47.0s), 58/58 VUs, 2961 complete and 0 interrupted iterations
default   [  78% ] 58/58 VUs  3m47.0s/4m50.0s

running (3m48.0s), 58/58 VUs, 2981 complete and 0 interrupted iterations
default   [  79% ] 58/58 VUs  3m48.0s/4m50.0s

running (3m49.0s), 58/58 VUs, 2995 complete and 0 interrupted iterations
default   [  79% ] 58/58 VUs  3m49.0s/4m50.0s

running (3m50.0s), 58/58 VUs, 3014 complete and 0 interrupted iterations
default   [  79% ] 58/58 VUs  3m50.0s/4m50.0s

running (3m51.0s), 58/58 VUs, 3028 complete and 0 interrupted iterations
default   [  80% ] 58/58 VUs  3m51.0s/4m50.0s

running (3m52.0s), 57/58 VUs, 3044 complete and 0 interrupted iterations
default   [  80% ] 57/58 VUs  3m52.0s/4m50.0s

running (3m53.0s), 57/58 VUs, 3058 complete and 0 interrupted iterations
default   [  80% ] 57/58 VUs  3m53.0s/4m50.0s

running (3m54.0s), 57/58 VUs, 3078 complete and 0 interrupted iterations
default   [  81% ] 57/58 VUs  3m54.0s/4m50.0s

running (3m55.0s), 55/58 VUs, 3097 complete and 0 interrupted iterations
default   [  81% ] 55/58 VUs  3m55.0s/4m50.0s

running (3m56.0s), 55/58 VUs, 3112 complete and 0 interrupted iterations
default   [  81% ] 55/58 VUs  3m56.0s/4m50.0s

running (3m57.0s), 52/58 VUs, 3132 complete and 0 interrupted iterations
default   [  82% ] 52/58 VUs  3m57.0s/4m50.0s

running (3m58.0s), 52/58 VUs, 3144 complete and 0 interrupted iterations
default   [  82% ] 52/58 VUs  3m58.0s/4m50.0s

running (3m59.0s), 52/58 VUs, 3160 complete and 0 interrupted iterations
default   [  82% ] 52/58 VUs  3m59.0s/4m50.0s

running (4m00.0s), 50/58 VUs, 3175 complete and 0 interrupted iterations
default   [  83% ] 50/58 VUs  4m00.0s/4m50.0s

running (4m01.0s), 50/58 VUs, 3190 complete and 0 interrupted iterations
default   [  83% ] 50/58 VUs  4m01.0s/4m50.0s

running (4m02.0s), 50/58 VUs, 3207 complete and 0 interrupted iterations
default   [  83% ] 50/58 VUs  4m02.0s/4m50.0s

running (4m03.0s), 48/58 VUs, 3219 complete and 0 interrupted iterations
default   [  84% ] 48/58 VUs  4m03.0s/4m50.0s

running (4m04.0s), 48/58 VUs, 3235 complete and 0 interrupted iterations
default   [  84% ] 48/58 VUs  4m04.0s/4m50.0s

running (4m05.0s), 44/58 VUs, 3252 complete and 0 interrupted iterations
default   [  84% ] 44/58 VUs  4m05.0s/4m50.0s

running (4m06.0s), 44/58 VUs, 3264 complete and 0 interrupted iterations
default   [  85% ] 44/58 VUs  4m06.0s/4m50.0s

running (4m07.0s), 43/58 VUs, 3276 complete and 0 interrupted iterations
default   [  85% ] 43/58 VUs  4m07.0s/4m50.0s

running (4m08.0s), 43/58 VUs, 3290 complete and 0 interrupted iterations
default   [  86% ] 43/58 VUs  4m08.0s/4m50.0s

running (4m09.0s), 43/58 VUs, 3301 complete and 0 interrupted iterations
default   [  86% ] 43/58 VUs  4m09.0s/4m50.0s

running (4m10.0s), 42/58 VUs, 3314 complete and 0 interrupted iterations
default   [  86% ] 42/58 VUs  4m10.0s/4m50.0s

running (4m11.0s), 40/58 VUs, 3328 complete and 0 interrupted iterations
default   [  87% ] 40/58 VUs  4m11.0s/4m50.0s

running (4m12.0s), 39/58 VUs, 3341 complete and 0 interrupted iterations
default   [  87% ] 39/58 VUs  4m12.0s/4m50.0s

running (4m13.0s), 39/58 VUs, 3352 complete and 0 interrupted iterations
default   [  87% ] 39/58 VUs  4m13.0s/4m50.0s

running (4m14.0s), 38/58 VUs, 3367 complete and 0 interrupted iterations
default   [  88% ] 38/58 VUs  4m14.0s/4m50.0s

running (4m15.0s), 36/58 VUs, 3378 complete and 0 interrupted iterations
default   [  88% ] 36/58 VUs  4m15.0s/4m50.0s

running (4m16.0s), 36/58 VUs, 3388 complete and 0 interrupted iterations
default   [  88% ] 36/58 VUs  4m16.0s/4m50.0s

running (4m17.0s), 33/58 VUs, 3399 complete and 0 interrupted iterations
default   [  89% ] 33/58 VUs  4m17.0s/4m50.0s

running (4m18.0s), 33/58 VUs, 3409 complete and 0 interrupted iterations
default   [  89% ] 33/58 VUs  4m18.0s/4m50.0s

running (4m19.0s), 33/58 VUs, 3419 complete and 0 interrupted iterations
default   [  89% ] 33/58 VUs  4m19.0s/4m50.0s

running (4m20.0s), 30/58 VUs, 3429 complete and 0 interrupted iterations
default   [  90% ] 30/58 VUs  4m20.0s/4m50.0s

running (4m21.0s), 30/58 VUs, 3440 complete and 0 interrupted iterations
default   [  90% ] 30/58 VUs  4m21.0s/4m50.0s

running (4m22.0s), 29/58 VUs, 3448 complete and 0 interrupted iterations
default   [  90% ] 29/58 VUs  4m22.0s/4m50.0s

running (4m23.0s), 28/58 VUs, 3455 complete and 0 interrupted iterations
default   [  91% ] 28/58 VUs  4m23.0s/4m50.0s

running (4m24.0s), 28/58 VUs, 3465 complete and 0 interrupted iterations
default   [  91% ] 28/58 VUs  4m24.0s/4m50.0s

running (4m25.0s), 26/58 VUs, 3476 complete and 0 interrupted iterations
default   [  91% ] 26/58 VUs  4m25.0s/4m50.0s

running (4m26.0s), 25/58 VUs, 3482 complete and 0 interrupted iterations
default   [  92% ] 25/58 VUs  4m26.0s/4m50.0s

running (4m27.0s), 24/58 VUs, 3490 complete and 0 interrupted iterations
default   [  92% ] 24/58 VUs  4m27.0s/4m50.0s

running (4m28.0s), 23/58 VUs, 3498 complete and 0 interrupted iterations
default   [  92% ] 23/58 VUs  4m28.0s/4m50.0s

running (4m29.0s), 22/58 VUs, 3504 complete and 0 interrupted iterations
default   [  93% ] 22/58 VUs  4m29.0s/4m50.0s

running (4m30.0s), 21/58 VUs, 3509 complete and 0 interrupted iterations
default   [  93% ] 21/58 VUs  4m30.0s/4m50.0s

running (4m31.0s), 20/58 VUs, 3513 complete and 0 interrupted iterations
default   [  93% ] 20/58 VUs  4m31.0s/4m50.0s

running (4m32.0s), 20/58 VUs, 3521 complete and 0 interrupted iterations
default   [  94% ] 20/58 VUs  4m32.0s/4m50.0s

running (4m33.0s), 19/58 VUs, 3526 complete and 0 interrupted iterations
default   [  94% ] 19/58 VUs  4m33.0s/4m50.0s

running (4m34.0s), 17/58 VUs, 3530 complete and 0 interrupted iterations
default   [  94% ] 17/58 VUs  4m34.0s/4m50.0s

running (4m35.0s), 15/58 VUs, 3541 complete and 0 interrupted iterations
default   [  95% ] 15/58 VUs  4m35.0s/4m50.0s

running (4m36.0s), 14/58 VUs, 3545 complete and 0 interrupted iterations
default   [  95% ] 14/58 VUs  4m36.0s/4m50.0s

running (4m37.0s), 14/58 VUs, 3547 complete and 0 interrupted iterations
default   [  96% ] 14/58 VUs  4m37.0s/4m50.0s

running (4m38.0s), 12/58 VUs, 3551 complete and 0 interrupted iterations
default   [  96% ] 12/58 VUs  4m38.0s/4m50.0s

running (4m39.0s), 12/58 VUs, 3557 complete and 0 interrupted iterations
default   [  96% ] 12/58 VUs  4m39.0s/4m50.0s

running (4m40.0s), 12/58 VUs, 3559 complete and 0 interrupted iterations
default   [  97% ] 12/58 VUs  4m40.0s/4m50.0s

running (4m41.0s), 12/58 VUs, 3561 complete and 0 interrupted iterations
default   [  97% ] 12/58 VUs  4m41.0s/4m50.0s

running (4m42.0s), 10/58 VUs, 3568 complete and 0 interrupted iterations
default   [  97% ] 10/58 VUs  4m42.0s/4m50.0s

running (4m43.0s), 09/58 VUs, 3571 complete and 0 interrupted iterations
default   [  98% ] 09/58 VUs  4m43.0s/4m50.0s

running (4m44.0s), 09/58 VUs, 3573 complete and 0 interrupted iterations
default   [  98% ] 09/58 VUs  4m44.0s/4m50.0s

running (4m45.0s), 06/58 VUs, 3577 complete and 0 interrupted iterations
default   [  98% ] 06/58 VUs  4m45.0s/4m50.0s

running (4m46.0s), 05/58 VUs, 3579 complete and 0 interrupted iterations
default   [  99% ] 05/58 VUs  4m46.0s/4m50.0s

running (4m47.0s), 05/58 VUs, 3581 complete and 0 interrupted iterations
default   [  99% ] 05/58 VUs  4m47.0s/4m50.0s

running (4m48.0s), 04/58 VUs, 3582 complete and 0 interrupted iterations
default   [  99% ] 04/58 VUs  4m48.0s/4m50.0s

running (4m49.0s), 03/58 VUs, 3583 complete and 0 interrupted iterations
default   [ 100% ] 03/58 VUs  4m49.0s/4m50.0s

running (4m50.0s), 01/58 VUs, 3585 complete and 0 interrupted iterations
default   [ 100% ] 01/58 VUs  4m50.0s/4m50.0s


  █ TOTAL RESULTS 

    checks_total.......: 25218  86.838655/s
    checks_succeeded...: 70.16% 17694 out of 25218
    checks_failed......: 29.83% 7524 out of 25218

    ✓ login 200
    ✓ jwt presente
    ✗ expedientes por usuario 200
      ↳  75% — ✓ 2723 / ✗ 863
    ✗ hay data en expedientes por usuario
      ↳  75% — ✓ 2723 / ✗ 863
    ✗ expedientes por juzgado 200
      ↳  75% — ✓ 2709 / ✗ 877
    ✗ hay data en expedientes por juzgado
      ↳  75% — ✓ 2709 / ✗ 877
    ✗ pendientes de firma 200
      ↳  75% — ✓ 2698 / ✗ 888
    ✗ hay data en pendientes de firma
      ↳  75% — ✓ 2698 / ✗ 888
    ✗ hay documentos pendientes de firma
      ↳  36% — ✓ 1318 / ✗ 2268

    HTTP
    http_req_duration..............: avg=131.1ms  min=79.49ms  med=123.99ms max=1.22s    p(90)=156.69ms p(95)=190.16ms
      { expected_response:true }...: avg=139.91ms min=104.63ms med=130.41ms max=847.36ms p(90)=164.82ms p(95)=202.48ms
    http_req_failed................: 24.29% 2628 out of 10816
    http_reqs......................: 10816  37.245099/s

    EXECUTION
    iteration_duration.............: avg=3.4s     min=3.25s    med=3.38s    max=4.4s     p(90)=3.48s    p(95)=3.55s   
    iterations.....................: 3586   12.348458/s
    vus............................: 1      min=1             max=58
    vus_max........................: 58     min=58            max=58

    NETWORK
    data_received..................: 36 MB  125 kB/s
    data_sent......................: 26 MB  90 kB/s



running (4m50.4s), 00/58 VUs, 3586 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/58 VUs  4m50s